OpenFOAM/Flow-past-a-sphere-OpenFOAM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include    "../constants"

convertToMeters 1;

z1      $z1;
z2      $z2;
x1      $x1;
x2      $x2;
y1      $y1;
y2      $y2;    

vertices
(
    ($x1 $y1 $z1)
    ($x2 $y1 $z1)
    ($x2 $y2 $z1)
    ($x1 $y2 $z1)

    ($x1 $y1 $z2)
    ($x2 $y1 $z2)
    ($x2 $y2 $z2)
    ($x1 $y2 $z2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
         
    outlet
    {
        type patch;
        faces
        (
            (5 1 2 6)
        );
    }
    
    top
    {
        type patch;
        faces
        (
            (7 6 2 3)
        );
    }
    
    bottom
    {
        type patch;
        faces
        (
            (5 4 0 1)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (4 5 7 6)
            (1 0 3 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
