OpenFOAM/Flow-past-a-sphere-OpenFOAM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1600;
        startFace       187200;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       188800;
    }
    top
    {
        type            patch;
        nFaces          1600;
        startFace       190400;
    }
    bottom
    {
        type            patch;
        nFaces          1600;
        startFace       192000;
    }
    sides
    {
        type            patch;
        nFaces          3200;
        startFace       193600;
    }
)

// ************************************************************************* //
