OpenFOAM/Flow-past-a-sphere-OpenFOAM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                         steadyState;
}

gradSchemes
{
    default                         cellLimited Gauss linear 1;
    grad(U)                         cellLimited Gauss linear 1;
}

divSchemes
{
    default                         none;
    div(phi,U)                      Gauss linearUpwindV grad(U);
    div(phi,nuTilda)                Gauss linearUpwind default;
    div(phi,k)                      Gauss linearUpwind default;
    div(phi,epsilon)                Gauss linearUpwind default;
    div(phi,omega)                  Gauss linearUpwind default;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default                         Gauss linear limited 0.75;
}

interpolationSchemes
{
    default                         linear;
}

snGradSchemes
{
    default                         limited 0.75;
}

wallDist
{
                                    method meshWave;
}


// ************************************************************************* //
